app/controllers/coffees_controller.rb

    def index
        coffees = Coffee.all
---
SELECT "coffees".* FROM "coffees"