app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
    def index
        orders = Order.all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        order = Order.find(params[:id])